{"type":"data","nodes":[null,null,{"type":"data","data":[{"filteredTag":1,"filteredPostsByTag":2},"tailwindcss",[3],{"title":4,"date":5,"draft":6,"summary":7,"tags":8,"type":11,"content":12,"slug":13},"Hello world!","2023-12-01",false,"Is this thing up?",[9,10,1],"foobar","sveltekit","post","\u003Cp data-svelte-h=\"svelte-19571kz\">This website has been in the making for a while. My initial explorations were setups using Jekyll and Hugo. Both are extremely versatile and have quite a bit of fan following on the web (check out the amount of templates that are out there for Hugo). While Hugo was extremely easy to get boilerplate code going, Jekyll needed a bit more familiarization. While I don’t have any strong opinions against either of them, they just didn’t feel right for my needs.\u003C/p> \u003Cp data-svelte-h=\"svelte-1ytdun3\">Until I found SvelteKit. It felt simple yet powerful. As a backend person, I loved how layouts, pages, script and styles all tied together. You could have a site wide overall layout but also one for each page. It felt easy to digest how the load function worked and passed data back to the pages. The tutorials were/are great (I haven’t yet explored them in their entirety) and I kept coming back for more while reading them. And before I knew it, I had a skeleton up and running on my local dev server.\u003C/p> \u003Cp data-svelte-h=\"svelte-zqex2m\">The next good find was tailwindcss. The simplicity and power of customization really help put the focus back on design and development. The CSS classes felt utilitarian and easy to remember.\u003C/p> \u003Cp data-svelte-h=\"svelte-x0cx0b\">If I have to be specific, both have a common point going for them which is - great documentation. As a developer this is one of the most important factor while adopting a new framework/language or technology. I’ve still just touched the tips of both the technological icebergs and there’s lots more to learn. But I’m loving the results so far and willing to see how far I can explore.\u003C/p> \u003Cp data-svelte-h=\"svelte-17aue00\">“Frameworks are not tools for organising your code, they are tools for organising your mind” - YGLF 2019: Rich Harris - Rethinking reactivity\u003C/p>","Helloworld"],"uses":{"params":["filteredTag"]}}]}
